NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_serial_handler_mesh.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <unity.h>
#include <cmock.h>

#include "serial_handler_mesh.h"
#include "serial_status.h"

#include "serial_mock.h"
#include "net_state_mock.h"
#include "access_mock.h"
#include "device_state_manager_mock.h"
#include "nrf_mesh_mock.h"
#include "nrf_mesh_events_mock.h"

#include "utils.h"
#include "test_assert.h"

#define CMD_LENGTH_CHECK(_opcode, _intended_length)                                                   \
    do {                                                                                              \
        serial_packet_t _cmd;                                                                         \
        _cmd.opcode = _opcode;                                                                        \
        _cmd.length = _intended_length + 1;                                                           \
        serial_cmd_rsp_send_ExpectWithArray(_opcode, SERIAL_STATUS_ERROR_INVALID_LENGTH, NULL, 0, 0); \
        serial_handler_mesh_rx(&_cmd);                                                                \
        _cmd.length = _intended_length + 1;                                                           \
        serial_cmd_rsp_send_ExpectWithArray(_opcode, SERIAL_STATUS_ERROR_INVALID_LENGTH, NULL, 0, 0); \
        serial_handler_mesh_rx(&_cmd);                                                                \
    } while (0)

static nrf_mesh_tx_params_t m_expected_tx_params;
static uint32_t m_expected_packet_send;
static uint32_t m_packet_send_return;
static const nrf_mesh_evt_handler_t * mp_evt_handler;
static serial_packet_t m_expected_tx_packet;
static uint32_t m_expected_serial_tx;

static uint32_t nrf_mesh_packet_send_cb(const nrf_mesh_tx_params_t * p_params, uint32_t * p_packet_ref, int count)
{
    TEST_ASSERT_TRUE(m_expected_packet_send > 0);
    TEST_ASSERT_EQUAL(m_expected_tx_params.dst.type, p_params->dst.type);
    TEST_ASSERT_EQUAL(m_expected_tx_params.dst.value, p_params->dst.value);
    TEST_ASSERT_EQUAL(m_expected_tx_params.dst.p_virtual_uuid, p_params->dst.p_virtual_uuid);
    TEST_ASSERT_EQUAL(m_expected_tx_params.ttl, p_params->ttl);
    TEST_ASSERT_EQUAL(m_expected_tx_params.force_segmented, p_params->force_segmented);
    TEST_ASSERT_EQUAL(m_expected_tx_params.transmic_size, p_params->transmic_size);
    TEST_ASSERT_EQUAL(m_expected_tx_params.src, p_params->src);
    TEST_ASSERT_EQUAL(m_expected_tx_params.security_material.p_net, p_params->security_material.p_net);
    TEST_ASSERT_EQUAL(m_expected_tx_params.security_material.p_app, p_params->security_material.p_app);
    TEST_ASSERT_EQUAL(m_expected_tx_params.data_len, p_params->data_len);
    TEST_ASSERT_EQUAL(m_expected_tx_params.p_data, p_params->p_data);
    m_expected_packet_send--;
    return m_packet_send_return;
}

static void nrf_mesh_event_handler_add_cb(nrf_mesh_evt_handler_t * p_handler, int count)
{
    mp_evt_handler = p_handler;
}

static void serial_tx_cb(const serial_packet_t * p_packet, int count)
{
    TEST_ASSERT_TRUE(m_expected_serial_tx > 0);
    m_expected_serial_tx--;
    TEST_ASSERT_EQUAL_HEX8_ARRAY((uint8_t *) &m_expected_tx_packet, (uint8_t *) p_packet, m_expected_tx_packet.length + 1);
}

void setUp(void)
{
    device_state_manager_mock_Init();
    serial_mock_Init();
    nrf_mesh_mock_Init();
    nrf_mesh_events_mock_Init();
    net_state_mock_Init();
    access_mock_Init();
    m_expected_packet_send = 0;
    m_packet_send_return = 0;
    memset(&m_expected_tx_params, 0, sizeof(m_expected_tx_params));
    memset(&m_expected_tx_packet, 0, sizeof(m_expected_tx_packet));
}

void tearDown(void)
{
    device_state_manager_mock_Verify();
    device_state_manager_mock_Destroy();
    serial_mock_Verify();
    serial_mock_Destroy();
    nrf_mesh_mock_Verify();
    nrf_mesh_mock_Destroy();
    nrf_mesh_events_mock_Verify();
    nrf_mesh_events_mock_Destroy();
    net_state_mock_Verify();
    net_state_mock_Destroy();
    access_mock_Verify();
    access_mock_Destroy();
}

/*****************************************************************************
* Tests
*****************************************************************************/
void test_invalid_cmd(void)
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_RANGE_MESH_END;
    cmd.length = 1;
    serial_cmd_rsp_send_Expect(cmd.opcode, SERIAL_STATUS_ERROR_CMD_UNKNOWN, NULL, 0);
    serial_handler_mesh_rx(&cmd);
}

void test_enable_disable(void)
{
    serial_packet_t cmd;

