NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_serial_handler_mesh.c
    cmd.opcode = SERIAL_OPCODE_CMD_MESH_ENABLE;
    cmd.length = 1;
    nrf_mesh_enable_ExpectAndReturn(0x12345678);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, 0xAA, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_DISABLE;
    cmd.length = 1;
    nrf_mesh_disable_ExpectAndReturn(0x12345678);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, 0xAA, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
}

void test_stateclear()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_MESH_STATE_CLEAR;
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD;
    dsm_clear_Expect();
    access_clear_Expect();
    net_state_reset_Expect();
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_MESH_STATE_CLEAR, SERIAL_STATUS_SUCCESS, NULL, 0);
    serial_handler_mesh_rx(&cmd);
}

void test_subnet(void)
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_MESH_SUBNET_ADD;
    cmd.length = 19;
    cmd.payload.cmd.mesh.subnet_add.net_key_index = 0x1234;
    dsm_handle_t handle = 0x5678;
    dsm_subnet_add_ExpectAndReturn(0x1234, cmd.payload.cmd.mesh.subnet_add.key, NULL, NRF_SUCCESS);
    dsm_subnet_add_IgnoreArg_p_subnet_handle();
    dsm_subnet_add_ReturnThruPtr_p_subnet_handle(&handle);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &handle, sizeof(handle), sizeof(handle));
    serial_handler_mesh_rx(&cmd);
    dsm_subnet_add_ExpectAndReturn(0x1234, cmd.payload.cmd.mesh.subnet_add.key, NULL, 0x12345678);
    dsm_subnet_add_IgnoreArg_p_subnet_handle();
    dsm_subnet_add_ReturnThruPtr_p_subnet_handle(&handle);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, 0xAA, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_SUBNET_UPDATE;
    cmd.length = 19;
    cmd.payload.cmd.mesh.subnet_update.subnet_handle = 0x5678;
    dsm_subnet_update_ExpectAndReturn(0x5678, cmd.payload.cmd.mesh.subnet_update.key, NRF_SUCCESS);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &handle, sizeof(handle), sizeof(handle));
    serial_handler_mesh_rx(&cmd);
    dsm_subnet_update_ExpectAndReturn(0x5678, cmd.payload.cmd.mesh.subnet_update.key, 0x12345678);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, 0xAA, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_SUBNET_DELETE;
    cmd.length = 3;
    cmd.payload.cmd.mesh.subnet_delete.subnet_handle = 0x5678;
    dsm_subnet_delete_ExpectAndReturn(0x5678, NRF_SUCCESS);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &handle, sizeof(handle), sizeof(handle));
    serial_handler_mesh_rx(&cmd);
    dsm_subnet_delete_ExpectAndReturn(0x5678, 0x12345678);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, 0xAA, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_SUBNET_GET_ALL;
    cmd.length = 1;
    dsm_handle_t handle_list[DSM_SUBNET_MAX];
    for (uint32_t i = 0; i < DSM_SUBNET_MAX; i++)
    {
        handle_list[i] = 0x12A0 + i;
    }
    uint32_t count = 5;
    TEST_ASSERT_TRUE_MESSAGE(count < DSM_SUBNET_MAX, "Count should be lower than SUBNET_MAX to avoid segfault");
    dsm_subnet_get_all_ExpectAndReturn(NULL, NULL, NRF_SUCCESS);
    dsm_subnet_get_all_IgnoreArg_p_key_list();
    dsm_subnet_get_all_IgnoreArg_p_count();
    dsm_subnet_get_all_ReturnMemThruPtr_p_key_list(handle_list, sizeof(handle_list[0]) * count);
    dsm_subnet_get_all_ReturnMemThruPtr_p_count(&count, sizeof(count));
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) handle_list, sizeof(handle_list[0]) * count, sizeof(handle_list[0]) * count);
    serial_handler_mesh_rx(&cmd);
    dsm_subnet_get_all_ExpectAndReturn(NULL, NULL, 0x12345678);
    dsm_subnet_get_all_IgnoreArg_p_key_list();
    dsm_subnet_get_all_IgnoreArg_p_count();
    dsm_subnet_get_all_ReturnArrayThruPtr_p_key_list(handle_list, count);
    dsm_subnet_get_all_ReturnMemThruPtr_p_count(&count, sizeof(count));
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);
    count = 0;
    dsm_subnet_get_all_ExpectAndReturn(NULL, NULL, NRF_SUCCESS);
    dsm_subnet_get_all_IgnoreArg_p_key_list();
    dsm_subnet_get_all_IgnoreArg_p_count();
    dsm_subnet_get_all_ReturnArrayThruPtr_p_key_list(handle_list, count);
    dsm_subnet_get_all_ReturnMemThruPtr_p_count(&count, sizeof(count));
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_SUBNET_COUNT_MAX_GET;
    cmd.length = 1;
    uint16_t list_size = DSM_SUBNET_MAX;
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &list_size, sizeof(list_size), sizeof(list_size));
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);
}

void test_appkey(void)
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_MESH_APPKEY_ADD;
    cmd.length = 21;
    cmd.payload.cmd.mesh.appkey_add.app_key_index = 0x1234;
    cmd.payload.cmd.mesh.appkey_add.subnet_handle = 0xABCD;
    dsm_handle_t handle = 0x5678;
    dsm_appkey_add_ExpectAndReturn(0x1234, 0xABCD, cmd.payload.cmd.mesh.appkey_add.key, NULL, NRF_SUCCESS);
    dsm_appkey_add_IgnoreArg_p_app_handle();
    dsm_appkey_add_ReturnThruPtr_p_app_handle(&handle);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &handle, sizeof(handle), sizeof(handle));
    serial_handler_mesh_rx(&cmd);
    dsm_appkey_add_ExpectAndReturn(0x1234, 0xABCD, cmd.payload.cmd.mesh.appkey_add.key, NULL, 0x12345678);
    dsm_appkey_add_IgnoreArg_p_app_handle();
    dsm_appkey_add_ReturnThruPtr_p_app_handle(&handle);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, 0xAA, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_APPKEY_UPDATE;
    cmd.length = 19;
    cmd.payload.cmd.mesh.appkey_update.appkey_handle = 0x5678;
    dsm_appkey_update_ExpectAndReturn(0x5678, cmd.payload.cmd.mesh.appkey_update.key, NRF_SUCCESS);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &handle, sizeof(handle), sizeof(handle));
    serial_handler_mesh_rx(&cmd);
    dsm_appkey_update_ExpectAndReturn(0x5678, cmd.payload.cmd.mesh.appkey_update.key, 0x12345678);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, 0xAA, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_APPKEY_DELETE;
    cmd.length = 3;
    cmd.payload.cmd.mesh.appkey_delete.appkey_handle = 0x5678;
    dsm_appkey_delete_ExpectAndReturn(0x5678, NRF_SUCCESS);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &handle, sizeof(handle), sizeof(handle));
    serial_handler_mesh_rx(&cmd);
    dsm_appkey_delete_ExpectAndReturn(0x5678, 0x12345678);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, 0xAA, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_APPKEY_GET_ALL;
    cmd.length = 3;
    cmd.payload.cmd.mesh.appkey_get_all.subnet_handle = 0x5678;
    dsm_handle_t handle_list[DSM_SUBNET_MAX];
    handle_list[0] = 0x5678;
    for (uint32_t i = 1; i < DSM_SUBNET_MAX; i++)
    {
        handle_list[i] = 0x1200 + i;
    }

    uint32_t count = 5;
    dsm_appkey_get_all_ExpectAndReturn(0x5678, NULL, NULL, NRF_SUCCESS);
    dsm_appkey_get_all_IgnoreArg_p_key_list();
    dsm_appkey_get_all_IgnoreArg_p_count();
    dsm_appkey_get_all_ReturnArrayThruPtr_p_key_list(&handle_list[1], count);
    dsm_appkey_get_all_ReturnThruPtr_p_count(&count);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS,
            (uint8_t *) handle_list,
            sizeof(handle_list[0]) * (count + 1),
            sizeof(handle_list[0]) * (count + 1));
    serial_handler_mesh_rx(&cmd);
    dsm_appkey_get_all_ExpectAndReturn(0x5678, NULL, NULL, 0x12345678);
    dsm_appkey_get_all_IgnoreArg_p_key_list();
    dsm_appkey_get_all_IgnoreArg_p_count();
    dsm_appkey_get_all_ReturnArrayThruPtr_p_key_list(&handle_list[1], count);
    dsm_appkey_get_all_ReturnMemThruPtr_p_count(&count, sizeof(count));
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);

