NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_serial_handler_mesh.c
    count = 0;
    dsm_appkey_get_all_ExpectAndReturn(0x5678, NULL, NULL, NRF_SUCCESS);
    dsm_appkey_get_all_IgnoreArg_p_key_list();
    dsm_appkey_get_all_IgnoreArg_p_count();
    dsm_appkey_get_all_ReturnArrayThruPtr_p_key_list(handle_list, count);
    dsm_appkey_get_all_ReturnMemThruPtr_p_count(&count, sizeof(count));
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_APPKEY_COUNT_MAX_GET;
    cmd.length = 1;
    uint16_t list_size = DSM_APP_MAX;
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &list_size, sizeof(list_size), sizeof(list_size));
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);
}

void test_devkey(void)
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_MESH_DEVKEY_ADD;
    cmd.length = 21;
    cmd.payload.cmd.mesh.devkey_add.owner_addr = 0x1234;
    cmd.payload.cmd.mesh.devkey_add.subnet_handle = 0xABCD;
    dsm_handle_t handle = 0x5678;
    dsm_devkey_add_ExpectAndReturn(0x1234, 0xABCD, cmd.payload.cmd.mesh.devkey_add.key, NULL, NRF_SUCCESS);
    dsm_devkey_add_IgnoreArg_p_devkey_handle();
    dsm_devkey_add_ReturnThruPtr_p_devkey_handle(&handle);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &handle, sizeof(handle), sizeof(handle));
    serial_handler_mesh_rx(&cmd);
    dsm_devkey_add_ExpectAndReturn(0x1234, 0xABCD, cmd.payload.cmd.mesh.devkey_add.key, NULL, 0x12345678);
    dsm_devkey_add_IgnoreArg_p_devkey_handle();
    dsm_devkey_add_ReturnThruPtr_p_devkey_handle(&handle);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, 0xAA, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_DEVKEY_DELETE;
    cmd.length = 3;
    cmd.payload.cmd.mesh.devkey_delete.devkey_handle = 0x5678;
    dsm_devkey_delete_ExpectAndReturn(0x5678, NRF_SUCCESS);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &handle, sizeof(handle), sizeof(handle));
    serial_handler_mesh_rx(&cmd);
    dsm_devkey_delete_ExpectAndReturn(0x5678, 0x12345678);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, 0xAA, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_DEVKEY_COUNT_MAX_GET;
    cmd.length = 1;
    uint16_t list_size = DSM_DEVICE_MAX;
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &list_size, sizeof(list_size), sizeof(list_size));
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);
}

void test_local_unicast(void)
{
    serial_packet_t cmd;

    /* Get before this thing has been set, shouldn't be prohibited by the serial. */
    cmd.opcode = SERIAL_OPCODE_CMD_MESH_ADDR_LOCAL_UNICAST_GET;
    cmd.length = 1;
    dsm_local_unicast_address_t addr;
    addr.address_start = NRF_MESH_ADDR_UNASSIGNED;
    addr.count = 0;
    dsm_local_unicast_addresses_get_Expect(NULL);
    dsm_local_unicast_addresses_get_IgnoreArg_p_address();
    dsm_local_unicast_addresses_get_ReturnMemThruPtr_p_address(&addr, sizeof(addr));
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &addr, sizeof(addr), sizeof(addr));
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_ADDR_LOCAL_UNICAST_SET;
    cmd.length = 5;
    cmd.payload.cmd.mesh.local_unicast_addr_set.start_address = 0x1234;
    cmd.payload.cmd.mesh.local_unicast_addr_set.count = 0x5678;
    addr.address_start = 0x1234;
    addr.count = 0x5678;
    dsm_local_unicast_addresses_set_ExpectWithArrayAndReturn(&addr, 1, 0x12345678);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, 0xAA, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);
}

void test_addresses(void)
{
    serial_packet_t cmd;
    dsm_handle_t addr_handle;

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_ADDR_GET;
    cmd.length = 3;
    cmd.payload.cmd.mesh.addr_get.address_handle = 0x1234;
    addr_handle = 0x1234;
    nrf_mesh_address_t addr;
    addr.value = 0xABCD;
    addr.type = NRF_MESH_ADDRESS_TYPE_GROUP;
    addr.p_virtual_uuid = NULL;
    dsm_address_get_ExpectAndReturn(0x1234, NULL, NRF_SUCCESS);
    dsm_address_get_IgnoreArg_p_address();
    dsm_address_get_ReturnThruPtr_p_address(&addr);
    dsm_address_is_rx_ExpectAndReturn(&addr, true);
    serial_evt_cmd_rsp_data_raw_addr_t raw_addr_rsp;
    raw_addr_rsp.addr_type = addr.type;
    raw_addr_rsp.subscribed = true;
    raw_addr_rsp.raw_short_addr = addr.value;
    raw_addr_rsp.address_handle = addr_handle;
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &raw_addr_rsp, sizeof(raw_addr_rsp) - NRF_MESH_UUID_SIZE, sizeof(raw_addr_rsp) - NRF_MESH_UUID_SIZE);
    serial_handler_mesh_rx(&cmd);
    /* fail getter */
    dsm_address_get_ExpectAndReturn(0x1234, NULL, 0x12345678);
    dsm_address_get_IgnoreArg_p_address();
    dsm_address_get_ReturnThruPtr_p_address(&addr);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, 0xAA, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
    /* get virtual */
    uint8_t virtual_uuid[NRF_MESH_UUID_SIZE];
    for (uint32_t i = 0; i < NRF_MESH_UUID_SIZE; i++)
    {
        virtual_uuid[i] = i;
    }
    addr.value = 0xFF01;
    addr.type = NRF_MESH_ADDRESS_TYPE_VIRTUAL;
    addr.p_virtual_uuid = virtual_uuid;
    dsm_address_get_ExpectAndReturn(0x1234, NULL, NRF_SUCCESS);
    dsm_address_get_IgnoreArg_p_address();
    dsm_address_get_ReturnThruPtr_p_address(&addr);
    dsm_address_is_rx_ExpectAndReturn(&addr, false);
    raw_addr_rsp.addr_type = addr.type;
    raw_addr_rsp.subscribed = false;
    raw_addr_rsp.raw_short_addr = addr.value;
    memcpy(raw_addr_rsp.virtual_uuid, virtual_uuid, NRF_MESH_UUID_SIZE);
    raw_addr_rsp.address_handle = addr_handle;
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &raw_addr_rsp, sizeof(raw_addr_rsp), sizeof(raw_addr_rsp));
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

