NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_serial_handler_mesh.c
    cmd.opcode = SERIAL_OPCODE_CMD_MESH_ADDR_GET_ALL;
    cmd.length = 1;
    dsm_handle_t addr_list[] =
    {
        0x0001,
        0x1234,
        0xABCD,
        0x5435,
        0x0001 /* shouldn't care about duplicates. */
    };
    uint32_t count = ARRAY_SIZE(addr_list);
    dsm_address_get_all_ExpectAndReturn(NULL, NULL, NRF_SUCCESS);
    dsm_address_get_all_IgnoreArg_p_count();
    dsm_address_get_all_IgnoreArg_p_address_handle_list();
    dsm_address_get_all_ReturnArrayThruPtr_p_address_handle_list(addr_list, count);
    dsm_address_get_all_ReturnThruPtr_p_count(&count);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) addr_list, sizeof(addr_list[0]) * count, sizeof(addr_list[0]) * count);
    serial_handler_mesh_rx(&cmd);
    /* fail getter */
    dsm_address_get_all_ExpectAndReturn(NULL, NULL, 0x12345678);
    dsm_address_get_all_IgnoreArg_p_count();
    dsm_address_get_all_IgnoreArg_p_address_handle_list();
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, 0xAA, NULL, 0, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_ADDR_NONVIRTUAL_COUNT_MAX_GET;
    cmd.length = 1;
    uint16_t max_count = DSM_NONVIRTUAL_ADDR_MAX;
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &max_count, sizeof(max_count), sizeof(max_count));
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_ADDR_VIRTUAL_COUNT_MAX_GET;
    cmd.length = 1;
    max_count = DSM_VIRTUAL_ADDR_MAX;
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &max_count, sizeof(max_count), sizeof(max_count));
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

}

void test_addr_subscription(void)
{
    serial_packet_t cmd;
    dsm_handle_t addr_handle;

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_ADDR_SUBSCRIPTION_ADD;
    cmd.length = 3;
    addr_handle = 0x1234;
    cmd.payload.cmd.mesh.addr_subscription_add.address = 0x1234;
    dsm_address_subscription_add_ExpectAndReturn(0x1234, NULL, NRF_SUCCESS);
    dsm_address_subscription_add_IgnoreArg_p_address_handle();
    dsm_address_subscription_add_ReturnThruPtr_p_address_handle(&addr_handle);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &addr_handle, sizeof(addr_handle), sizeof(addr_handle));
    serial_handler_mesh_rx(&cmd);

    dsm_address_subscription_add_ExpectAndReturn(0x1234, NULL, 0x12345678);
    dsm_address_subscription_add_IgnoreArg_p_address_handle();
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    const uint8_t test_uuid[NRF_MESH_UUID_SIZE] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16 };
    cmd.opcode = SERIAL_OPCODE_CMD_MESH_ADDR_SUBSCRIPTION_ADD_VIRTUAL;
    cmd.length = 17;
    memcpy(cmd.payload.cmd.mesh.addr_subscription_add_virtual.uuid, test_uuid, sizeof(test_uuid));
    dsm_address_subscription_virtual_add_ExpectWithArrayAndReturn(test_uuid, sizeof(test_uuid), NULL, 0, NRF_SUCCESS);
    dsm_address_subscription_virtual_add_IgnoreArg_p_address_handle();
    dsm_address_subscription_virtual_add_ReturnThruPtr_p_address_handle(&addr_handle);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &addr_handle, sizeof(addr_handle), sizeof(addr_handle));
    serial_handler_mesh_rx(&cmd);

    dsm_address_subscription_virtual_add_ExpectWithArrayAndReturn(test_uuid, sizeof(test_uuid), NULL, 0, 0x12345678);
    dsm_address_subscription_virtual_add_IgnoreArg_p_address_handle();
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_ADDR_SUBSCRIPTION_REMOVE;
    cmd.length = 3;
    cmd.payload.cmd.mesh.addr_subscription_remove.address_handle = addr_handle;
    dsm_address_subscription_remove_ExpectAndReturn(addr_handle, NRF_SUCCESS);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &addr_handle, sizeof(addr_handle), sizeof(addr_handle));
    serial_handler_mesh_rx(&cmd);

    dsm_address_subscription_remove_ExpectAndReturn(addr_handle, 0x12345678);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);
}

void test_addr_publication(void)
{
    serial_packet_t cmd;
    dsm_handle_t addr_handle;

    addr_handle = 0x1234;
    cmd.opcode = SERIAL_OPCODE_CMD_MESH_ADDR_PUBLICATION_ADD;
    cmd.length = 3;
    cmd.payload.cmd.mesh.addr_publication_add.address = 0x1234;
    dsm_address_publish_add_ExpectAndReturn(0x1234, NULL, NRF_SUCCESS);
    dsm_address_publish_add_IgnoreArg_p_address_handle();
    dsm_address_publish_add_ReturnThruPtr_p_address_handle(&addr_handle);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &addr_handle, sizeof(addr_handle), sizeof(addr_handle));
    serial_handler_mesh_rx(&cmd);

    dsm_address_publish_add_ExpectAndReturn(0x1234, NULL, 0x12345678);
    dsm_address_publish_add_IgnoreArg_p_address_handle();
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

    const uint8_t test_uuid[NRF_MESH_UUID_SIZE] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16 };
    cmd.opcode = SERIAL_OPCODE_CMD_MESH_ADDR_PUBLICATION_ADD_VIRTUAL;
    cmd.length = 17;
    memcpy(cmd.payload.cmd.mesh.addr_publication_add_virtual.uuid, test_uuid, sizeof(test_uuid));
    dsm_address_publish_virtual_add_ExpectWithArrayAndReturn(test_uuid, sizeof(test_uuid), NULL, 0, NRF_SUCCESS);
    dsm_address_publish_virtual_add_IgnoreArg_p_address_handle();
    dsm_address_publish_virtual_add_ReturnThruPtr_p_address_handle(&addr_handle);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &addr_handle, sizeof(addr_handle), sizeof(addr_handle));
    serial_handler_mesh_rx(&cmd);

    dsm_address_publish_virtual_add_ExpectWithArrayAndReturn(test_uuid, sizeof(test_uuid), NULL, 0, 0x12345678);
    dsm_address_publish_virtual_add_IgnoreArg_p_address_handle();
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);

