NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_serial_handler_mesh.c
    cmd.opcode = SERIAL_OPCODE_CMD_MESH_ADDR_PUBLICATION_REMOVE;
    cmd.length = 3;
    cmd.payload.cmd.mesh.addr_publication_remove.address_handle = addr_handle;
    dsm_address_publish_remove_ExpectAndReturn(addr_handle, NRF_SUCCESS);
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_ExpectWithArray(cmd.opcode, SERIAL_STATUS_SUCCESS, (uint8_t *) &addr_handle, sizeof(addr_handle), sizeof(addr_handle));
    serial_handler_mesh_rx(&cmd);

    dsm_address_publish_remove_ExpectAndReturn(addr_handle, 0x12345678);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);
    CMD_LENGTH_CHECK(cmd.opcode, cmd.length);
}

void test_packet_send(void)
{
    serial_packet_t cmd;

    cmd.opcode = SERIAL_OPCODE_CMD_MESH_PACKET_SEND;
    cmd.length = 11; // no payload
    cmd.payload.cmd.mesh.packet_send.appkey_handle = 0x5678;
    cmd.payload.cmd.mesh.packet_send.force_segmented = true;
    cmd.payload.cmd.mesh.packet_send.transmic_size = 1;
    cmd.payload.cmd.mesh.packet_send.ttl = 0x32;
    cmd.payload.cmd.mesh.packet_send.src_addr = 0xABCD;
    cmd.payload.cmd.mesh.packet_send.dst_addr_handle = 0x0102;
    cmd.payload.cmd.mesh.packet_send.friendship_credential_flag = false;
    for (uint32_t i = 0; i < sizeof(cmd.payload.cmd.mesh.packet_send.data); i++)
    {
        cmd.payload.cmd.mesh.packet_send.data[i] = i;
    }
    nrf_mesh_network_secmat_t net;
    nrf_mesh_application_secmat_t app;
    nrf_mesh_secmat_t secmat;
    secmat.p_net = &net; secmat.p_app = &app;
    m_expected_packet_send = 1;
    m_packet_send_return = 0x12345678;
    m_expected_tx_params.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    m_expected_tx_params.dst.value = 0x1234;
    m_expected_tx_params.dst.p_virtual_uuid = NULL;
    m_expected_tx_params.ttl = 0x32;
    m_expected_tx_params.force_segmented = true;
    m_expected_tx_params.transmic_size = 1;
    m_expected_tx_params.src = 0xABCD;
    m_expected_tx_params.security_material.p_net = &net;
    m_expected_tx_params.security_material.p_app = &app;
    m_expected_tx_params.data_len = 0;
    m_expected_tx_params.p_data = NULL;
    dsm_local_unicast_address_t local_addr;
    local_addr.address_start = 0xABC0;
    local_addr.count = 0x10;
    dsm_address_get_ExpectAndReturn(0x0102, NULL, NRF_SUCCESS);
    dsm_address_get_IgnoreArg_p_address();
    dsm_address_get_ReturnThruPtr_p_address(&m_expected_tx_params.dst);
    dsm_tx_secmat_get_ExpectAndReturn(DSM_HANDLE_INVALID, 0x5678, NULL, NRF_SUCCESS);
    dsm_tx_secmat_get_IgnoreArg_p_secmat();
    dsm_tx_secmat_get_ReturnMemThruPtr_p_secmat(&secmat, sizeof(secmat));
    dsm_local_unicast_addresses_get_Expect(NULL);
    dsm_local_unicast_addresses_get_IgnoreArg_p_address();
    dsm_local_unicast_addresses_get_ReturnThruPtr_p_address(&local_addr);
    nrf_mesh_packet_send_StubWithCallback(nrf_mesh_packet_send_cb);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);
    TEST_ASSERT_EQUAL(0, m_expected_packet_send);

    cmd.length = 10; // one too short
    serial_cmd_rsp_send_Expect(cmd.opcode, SERIAL_STATUS_ERROR_INVALID_LENGTH, NULL, 0);
    serial_handler_mesh_rx(&cmd);

    cmd.length = 99; //maxlen
    m_expected_packet_send = 1;
    m_expected_tx_params.data_len = 88;
    m_expected_tx_params.p_data = cmd.payload.cmd.mesh.packet_send.data;
    dsm_address_get_ExpectAndReturn(0x0102, NULL, NRF_SUCCESS);
    dsm_address_get_IgnoreArg_p_address();
    dsm_address_get_ReturnThruPtr_p_address(&m_expected_tx_params.dst);
    dsm_tx_secmat_get_ExpectAndReturn(DSM_HANDLE_INVALID, 0x5678, NULL, NRF_SUCCESS);
    dsm_tx_secmat_get_IgnoreArg_p_secmat();
    dsm_tx_secmat_get_ReturnMemThruPtr_p_secmat(&secmat, sizeof(secmat));
    dsm_local_unicast_addresses_get_Expect(NULL);
    dsm_local_unicast_addresses_get_IgnoreArg_p_address();
    dsm_local_unicast_addresses_get_ReturnThruPtr_p_address(&local_addr);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);
    TEST_ASSERT_EQUAL(0, m_expected_packet_send);

    /* give a source address that isn't a local unicast address */
    cmd.length = NRF_MESH_SERIAL_PAYLOAD_MAXLEN + 1;
    local_addr.address_start = 0x0103;
    dsm_address_get_ExpectAndReturn(0x0102, NULL, NRF_SUCCESS);
    dsm_address_get_IgnoreArg_p_address();
    dsm_address_get_ReturnThruPtr_p_address(&m_expected_tx_params.dst);
    dsm_local_unicast_addresses_get_Expect(NULL);
    dsm_local_unicast_addresses_get_IgnoreArg_p_address();
    dsm_local_unicast_addresses_get_ReturnThruPtr_p_address(&local_addr);
    serial_translate_error_ExpectAndReturn(NRF_ERROR_INVALID_ADDR, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);
    local_addr.address_start = 0x0100;
    local_addr.count = 2; // only includes 0x0100 and 0x0101, not 0x0102.
    dsm_address_get_ExpectAndReturn(0x0102, NULL, NRF_SUCCESS);
    dsm_address_get_IgnoreArg_p_address();
    dsm_address_get_ReturnThruPtr_p_address(&m_expected_tx_params.dst);
    dsm_local_unicast_addresses_get_Expect(NULL);
    dsm_local_unicast_addresses_get_IgnoreArg_p_address();
    dsm_local_unicast_addresses_get_ReturnThruPtr_p_address(&local_addr);
    serial_translate_error_ExpectAndReturn(NRF_ERROR_INVALID_ADDR, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);
    /* Unknown target address */
    dsm_address_get_ExpectAndReturn(0x0102, NULL, 0x12345678);
    dsm_address_get_IgnoreArg_p_address();
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);
    TEST_ASSERT_EQUAL(0, m_expected_packet_send);

    /* Test friendship secmat */
    cmd.length = 11;
    cmd.payload.cmd.mesh.packet_send.friendship_credential_flag = true;
    m_expected_packet_send = 1;
    m_packet_send_return = 0x12345678;
    m_expected_tx_params.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    m_expected_tx_params.dst.value = 0x1234;
    m_expected_tx_params.dst.p_virtual_uuid = NULL;
    m_expected_tx_params.ttl = 0x32;
    m_expected_tx_params.force_segmented = true;
    m_expected_tx_params.transmic_size = 1;
    m_expected_tx_params.src = 0xABCD;
    m_expected_tx_params.security_material.p_net = &net;
    m_expected_tx_params.security_material.p_app = &app;
    m_expected_tx_params.data_len = 0;
    m_expected_tx_params.p_data = NULL;
    local_addr.address_start = 0xABC0;
    local_addr.count = 0x10;
    dsm_address_get_ExpectAndReturn(0x0102, NULL, NRF_SUCCESS);
    dsm_address_get_IgnoreArg_p_address();
    dsm_address_get_ReturnThruPtr_p_address(&m_expected_tx_params.dst);
    dsm_tx_friendship_secmat_get_ExpectAndReturn(DSM_HANDLE_INVALID, 0x5678, NULL, NRF_SUCCESS);
    dsm_tx_friendship_secmat_get_IgnoreArg_p_secmat();
    dsm_tx_friendship_secmat_get_ReturnMemThruPtr_p_secmat(&secmat, sizeof(secmat));
    dsm_local_unicast_addresses_get_Expect(NULL);
    dsm_local_unicast_addresses_get_IgnoreArg_p_address();
    dsm_local_unicast_addresses_get_ReturnThruPtr_p_address(&local_addr);
    nrf_mesh_packet_send_StubWithCallback(nrf_mesh_packet_send_cb);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);
    TEST_ASSERT_EQUAL(0, m_expected_packet_send);

    /* Test friendship secmat */
    cmd.payload.cmd.mesh.packet_send.friendship_credential_flag = true;
    m_expected_packet_send = 1;
    m_packet_send_return = 0x12345678;
    m_expected_tx_params.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    m_expected_tx_params.dst.value = 0x1234;
    m_expected_tx_params.dst.p_virtual_uuid = NULL;
    m_expected_tx_params.ttl = 0x32;
    m_expected_tx_params.force_segmented = true;
    m_expected_tx_params.transmic_size = 1;
    m_expected_tx_params.src = 0xABCD;
    m_expected_tx_params.security_material.p_net = &net;
    m_expected_tx_params.security_material.p_app = &app;
    m_expected_tx_params.data_len = 0;
    m_expected_tx_params.p_data = NULL;
    local_addr.address_start = 0xABC0;
    local_addr.count = 0x10;
    dsm_address_get_ExpectAndReturn(0x0102, NULL, NRF_SUCCESS);
    dsm_address_get_IgnoreArg_p_address();
    dsm_address_get_ReturnThruPtr_p_address(&m_expected_tx_params.dst);
    dsm_tx_friendship_secmat_get_ExpectAndReturn(DSM_HANDLE_INVALID, 0x5678, NULL, NRF_ERROR_NOT_FOUND);
    dsm_tx_friendship_secmat_get_IgnoreArg_p_secmat();
    dsm_tx_friendship_secmat_get_ReturnMemThruPtr_p_secmat(&secmat, sizeof(secmat));
    dsm_tx_secmat_get_ExpectAndReturn(DSM_HANDLE_INVALID, 0x5678, NULL, NRF_SUCCESS);
    dsm_tx_secmat_get_IgnoreArg_p_secmat();
    dsm_tx_secmat_get_ReturnMemThruPtr_p_secmat(&secmat, sizeof(secmat));
    dsm_local_unicast_addresses_get_Expect(NULL);
    dsm_local_unicast_addresses_get_IgnoreArg_p_address();
    dsm_local_unicast_addresses_get_ReturnThruPtr_p_address(&local_addr);
    serial_translate_error_ExpectAndReturn(0x12345678, 0xAA);
    serial_cmd_rsp_send_Expect(cmd.opcode, 0xAA, NULL, 0);
    serial_handler_mesh_rx(&cmd);
    TEST_ASSERT_EQUAL(0, m_expected_packet_send);
}

