NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_serial_handler_mesh.c
void test_events(void)
{
    const uint32_t SEAL = 0x5EA15EA1;
    uint8_t packet[1 + NRF_MESH_SERIAL_PACKET_OVERHEAD + NRF_MESH_SERIAL_PAYLOAD_MAXLEN + sizeof(SEAL)];
    memcpy(&packet[sizeof(packet) - sizeof(SEAL)], &SEAL, sizeof(SEAL));
    serial_packet_t * p_packet = (serial_packet_t *) packet;

    serial_tx_StubWithCallback(serial_tx_cb);
    nrf_mesh_evt_handler_add_StubWithCallback(nrf_mesh_event_handler_add_cb);
    serial_handler_mesh_init();
    TEST_ASSERT_NOT_NULL(mp_evt_handler);
    dsm_handle_t app_handle = 0xABCD;
    dsm_handle_t dst_handle = 0xA0B0;
    dsm_handle_t subnet_handle = 0xF1E1;
    nrf_mesh_evt_t evt;
    nrf_mesh_rx_metadata_t metadata;
    evt.type = NRF_MESH_EVT_MESSAGE_RECEIVED;
    evt.params.message.dst.type = NRF_MESH_ADDRESS_TYPE_GROUP;
    evt.params.message.dst.value = 0x8ABC;
    evt.params.message.dst.p_virtual_uuid = NULL;
    evt.params.message.src.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    evt.params.message.src.value = 0x1234;
    evt.params.message.src.p_virtual_uuid = NULL;
    evt.params.message.p_metadata = &metadata;
    metadata.source = NRF_MESH_RX_SOURCE_SCANNER;
    metadata.params.scanner.adv_addr.addr_type = BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE;
    metadata.params.scanner.rssi = -5;

    for (uint32_t i = 0; i < BLE_GAP_ADDR_LEN; i++)
    {
        metadata.params.scanner.adv_addr.addr[i] = i;
    }
    uint8_t data[9];
    for (uint32_t i = 0; i < 9; i++)
    {
        data[i] = i;
    }
    nrf_mesh_network_secmat_t net;
    nrf_mesh_application_secmat_t app;
    for (uint32_t i = 0; i < NRF_MESH_KEY_SIZE; i++)
    {
        net.encryption_key[i] = i + 0x10;
        net.privacy_key[i] = i + 0x20;
        app.key[i] = i + 0x30;
    }
    net.nid = 0x43;
    app.is_device_key = false;
    app.aid = 0x12;
    evt.params.message.secmat.p_net = &net;
    evt.params.message.secmat.p_app = &app;
    evt.params.message.ttl = 0x84;
    evt.params.message.length = sizeof(data);
    evt.params.message.p_buffer = data;
    m_expected_serial_tx = 1;
    m_expected_tx_packet.length = 20 + sizeof(data);
    m_expected_tx_packet.opcode = SERIAL_OPCODE_EVT_MESH_MESSAGE_RECEIVED_SUBSCRIPTION;
    m_expected_tx_packet.payload.evt.mesh.message_received.src = 0x1234;
    m_expected_tx_packet.payload.evt.mesh.message_received.adv_addr_type = BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE;
    m_expected_tx_packet.payload.evt.mesh.message_received.appkey_handle = app_handle;
    m_expected_tx_packet.payload.evt.mesh.message_received.dst = dst_handle;
    m_expected_tx_packet.payload.evt.mesh.message_received.rssi = -5;
    m_expected_tx_packet.payload.evt.mesh.message_received.ttl = 0x84;
    m_expected_tx_packet.payload.evt.mesh.message_received.subnet_handle = subnet_handle;
    m_expected_tx_packet.payload.evt.mesh.message_received.actual_length = sizeof(data);
    memcpy(m_expected_tx_packet.payload.evt.mesh.message_received.data, data, sizeof(data));
    memcpy(m_expected_tx_packet.payload.evt.mesh.message_received.adv_addr, metadata.params.scanner.adv_addr.addr, BLE_GAP_ADDR_LEN);
    serial_packet_buffer_get_ExpectAndReturn(m_expected_tx_packet.length, NULL,  NRF_SUCCESS);
    serial_packet_buffer_get_IgnoreArg_pp_packet();
    serial_packet_buffer_get_ReturnThruPtr_pp_packet(&p_packet);
    p_packet->length = m_expected_tx_packet.length;
    dsm_address_handle_get_ExpectAndReturn(&evt.params.message.dst, NULL, NRF_SUCCESS);
    dsm_address_handle_get_IgnoreArg_p_address_handle();
    dsm_address_handle_get_ReturnThruPtr_p_address_handle(&dst_handle);
    dsm_subnet_handle_get_ExpectAndReturn(evt.params.message.secmat.p_net, subnet_handle);
    dsm_appkey_handle_get_ExpectAndReturn(evt.params.message.secmat.p_app, app_handle);
    mp_evt_handler->evt_cb(&evt);
    TEST_ASSERT_EQUAL(0, m_expected_serial_tx);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(&SEAL, &packet[sizeof(packet) - sizeof(SEAL)], sizeof(SEAL));
    /* virtual */
    m_expected_serial_tx = 1;
    uint8_t virtual_uuid[NRF_MESH_UUID_SIZE];
    evt.params.message.dst.type = NRF_MESH_ADDRESS_TYPE_VIRTUAL;
    evt.params.message.dst.p_virtual_uuid = virtual_uuid;
    dsm_address_handle_get_ExpectAndReturn(&evt.params.message.dst, NULL, NRF_SUCCESS);
    dsm_address_handle_get_IgnoreArg_p_address_handle();
    dsm_address_handle_get_ReturnThruPtr_p_address_handle(&dst_handle);
    dsm_subnet_handle_get_ExpectAndReturn(evt.params.message.secmat.p_net, subnet_handle);
    dsm_appkey_handle_get_ExpectAndReturn(evt.params.message.secmat.p_app, app_handle);
    serial_packet_buffer_get_ExpectAndReturn(m_expected_tx_packet.length, NULL,  NRF_SUCCESS);
    serial_packet_buffer_get_IgnoreArg_pp_packet();
    serial_packet_buffer_get_ReturnThruPtr_pp_packet(&p_packet);
    mp_evt_handler->evt_cb(&evt);
    TEST_ASSERT_EQUAL(0, m_expected_serial_tx);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(&SEAL, &packet[sizeof(packet) - sizeof(SEAL)], sizeof(SEAL));
    /* Assert if the address suddenly can't be found. This shouldn't happen, as
     * the packet wouldn't have made it to the event handler if it didn't exist
     * in the dsm. */
    dsm_address_handle_get_ExpectAndReturn(&evt.params.message.dst, NULL, NRF_ERROR_NOT_FOUND);
    dsm_address_handle_get_IgnoreArg_p_address_handle();
    dsm_address_handle_get_ReturnThruPtr_p_address_handle(&dst_handle);
    serial_packet_buffer_get_ExpectAndReturn(m_expected_tx_packet.length, NULL,  NRF_SUCCESS);
    serial_packet_buffer_get_IgnoreArg_pp_packet();
    serial_packet_buffer_get_ReturnThruPtr_pp_packet(&p_packet);
    p_packet->length = m_expected_tx_packet.length;
    TEST_NRF_MESH_ASSERT_EXPECT(mp_evt_handler->evt_cb(&evt));
    TEST_ASSERT_EQUAL_HEX8_ARRAY(&SEAL, &packet[sizeof(packet) - sizeof(SEAL)], sizeof(SEAL));
    /* No payload */
    m_expected_serial_tx = 1;
    m_expected_tx_packet.length = 20;
    evt.params.message.length = 0;
    evt.params.message.p_buffer = NULL;
    m_expected_tx_packet.payload.evt.mesh.message_received.actual_length = 0;
    dsm_address_handle_get_ExpectAndReturn(&evt.params.message.dst, NULL, NRF_SUCCESS);
    dsm_address_handle_get_IgnoreArg_p_address_handle();
    dsm_address_handle_get_ReturnThruPtr_p_address_handle(&dst_handle);
    dsm_subnet_handle_get_ExpectAndReturn(evt.params.message.secmat.p_net, subnet_handle);
    dsm_appkey_handle_get_ExpectAndReturn(evt.params.message.secmat.p_app, app_handle);
    serial_packet_buffer_get_ExpectAndReturn(m_expected_tx_packet.length, NULL,  NRF_SUCCESS);
    serial_packet_buffer_get_IgnoreArg_pp_packet();
    serial_packet_buffer_get_ReturnThruPtr_pp_packet(&p_packet);
    p_packet->length = m_expected_tx_packet.length;
    mp_evt_handler->evt_cb(&evt);
    TEST_ASSERT_EQUAL(0, m_expected_serial_tx);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(&SEAL, &packet[sizeof(packet) - sizeof(SEAL)], sizeof(SEAL));
    /* Max payload */
    uint8_t long_data[NRF_MESH_SEG_PAYLOAD_SIZE_MAX];
    for (uint32_t i = 0; i < NRF_MESH_SEG_PAYLOAD_SIZE_MAX; i++)
    {
        long_data[i] = i;
    }
    memcpy(m_expected_tx_packet.payload.evt.mesh.message_received.data,
            long_data,
            SERIAL_EVT_MESH_MESSAGE_RECEIVED_DATA_MAXLEN);
    m_expected_serial_tx = 1;
    m_expected_tx_packet.length = NRF_MESH_SERIAL_PAYLOAD_MAXLEN + 1; //TODO: MBTLE-1525: Don't cut this short here...
    m_expected_tx_packet.payload.evt.mesh.message_received.actual_length = NRF_MESH_SEG_PAYLOAD_SIZE_MAX;
    evt.params.message.length = NRF_MESH_SEG_PAYLOAD_SIZE_MAX;
    evt.params.message.p_buffer = long_data;
    dsm_address_handle_get_ExpectAndReturn(&evt.params.message.dst, NULL, NRF_SUCCESS);
    dsm_address_handle_get_IgnoreArg_p_address_handle();
    dsm_address_handle_get_ReturnThruPtr_p_address_handle(&dst_handle);
    dsm_subnet_handle_get_ExpectAndReturn(evt.params.message.secmat.p_net, subnet_handle);
    dsm_appkey_handle_get_ExpectAndReturn(evt.params.message.secmat.p_app, app_handle);
    serial_packet_buffer_get_ExpectAndReturn(m_expected_tx_packet.length, NULL,  NRF_SUCCESS);
    serial_packet_buffer_get_IgnoreArg_pp_packet();
    serial_packet_buffer_get_ReturnThruPtr_pp_packet(&p_packet);
    p_packet->length = m_expected_tx_packet.length;
    mp_evt_handler->evt_cb(&evt);
    TEST_ASSERT_EQUAL(0, m_expected_serial_tx);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(&SEAL, &packet[sizeof(packet) - sizeof(SEAL)], sizeof(SEAL));
    /* unicast */
    m_expected_serial_tx = 1;
    m_expected_tx_packet.opcode = SERIAL_OPCODE_EVT_MESH_MESSAGE_RECEIVED_UNICAST;
    m_expected_tx_packet.payload.evt.mesh.message_received.dst = evt.params.message.dst.value;
    evt.params.message.dst.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
    dsm_subnet_handle_get_ExpectAndReturn(evt.params.message.secmat.p_net, subnet_handle);
    dsm_appkey_handle_get_ExpectAndReturn(evt.params.message.secmat.p_app, app_handle);
    serial_packet_buffer_get_ExpectAndReturn(m_expected_tx_packet.length, NULL,  NRF_SUCCESS);
    serial_packet_buffer_get_IgnoreArg_pp_packet();
    serial_packet_buffer_get_ReturnThruPtr_pp_packet(&p_packet);
    p_packet->length = m_expected_tx_packet.length;
    mp_evt_handler->evt_cb(&evt);
    TEST_ASSERT_EQUAL(0, m_expected_serial_tx);
    memset(&evt, 0, sizeof(evt));
    memset(&m_expected_tx_packet, 0, sizeof(m_expected_tx_packet));
    TEST_ASSERT_EQUAL_HEX8_ARRAY(&SEAL, &packet[sizeof(packet) - sizeof(SEAL)], sizeof(SEAL));


    evt.type = NRF_MESH_EVT_IV_UPDATE_NOTIFICATION;
    evt.params.iv_update.state = (net_state_iv_update_t) 0x95;
    evt.params.iv_update.iv_index = 0x12345678;
    m_expected_serial_tx = 1;
    m_expected_tx_packet.length = 5;
    m_expected_tx_packet.opcode = SERIAL_OPCODE_EVT_MESH_IV_UPDATE_NOTIFICATION;
    m_expected_tx_packet.payload.evt.mesh.iv_update.iv_index = 0x12345678;
    serial_packet_buffer_get_ExpectAndReturn(m_expected_tx_packet.length, NULL,  NRF_SUCCESS);
    serial_packet_buffer_get_IgnoreArg_pp_packet();
    serial_packet_buffer_get_ReturnThruPtr_pp_packet(&p_packet);
    p_packet->length = m_expected_tx_packet.length;
    mp_evt_handler->evt_cb(&evt);
    TEST_ASSERT_EQUAL(0, m_expected_serial_tx);

    evt.type = NRF_MESH_EVT_KEY_REFRESH_NOTIFICATION;
    evt.params.key_refresh.phase = NRF_MESH_KEY_REFRESH_PHASE_2;
    evt.params.key_refresh.subnet_index = 4;
    m_expected_serial_tx = 1;
    m_expected_tx_packet.length = 4;
    m_expected_tx_packet.opcode = SERIAL_OPCODE_EVT_MESH_KEY_REFRESH_NOTIFICATION;
    m_expected_tx_packet.payload.evt.mesh.key_refresh.phase = (uint8_t) NRF_MESH_KEY_REFRESH_PHASE_2;
    m_expected_tx_packet.payload.evt.mesh.key_refresh.netkey_index = 4;
    serial_packet_buffer_get_ExpectAndReturn(m_expected_tx_packet.length, NULL, NRF_SUCCESS);
    serial_packet_buffer_get_IgnoreArg_pp_packet();
    serial_packet_buffer_get_ReturnThruPtr_pp_packet(&p_packet);
    p_packet->length = m_expected_tx_packet.length;
    mp_evt_handler->evt_cb(&evt);
    TEST_ASSERT_EQUAL(0, m_expected_serial_tx);

    /* Give it some random event it doesn't care about, should exit silently,
     * without side-effects. */
    evt.type = NRF_MESH_EVT_DFU_BANK_AVAILABLE;
    mp_evt_handler->evt_cb(&evt);
    TEST_ASSERT_EQUAL(0, m_expected_serial_tx);
}
